## Data Manipulation

In [3]:
import pandas as pd

In [4]:
df = pd.read_excel("../data/course_participants.xlsx")
df

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

## Index

In [5]:
df.index.name = "user_id"
df

         user_id   name  age  country  score continent
user_id
0           1001   Mark   55    Italy    4.5    Europe
1           1000   John   33      USA    6.7   America
2           1002    Tim   41      USA    3.9   America
3           1003  Jenny   12  Germany    9.0    Europe

## Selecting Data by label

In [6]:
# Select 1 value - Scalar
df.loc[0, "name"]

'Mark'

In [7]:
# Select 2 values - Series
df.loc[[0, 2], "age"]

user_id
0    55
2    41
Name: age, dtype: int64

In [8]:
# Select 1 column - Series
df.loc[:, "country"]

user_id
0      Italy
1        USA
2        USA
3    Germany
Name: country, dtype: object

In [9]:
# Select 1 row - Series
df.loc[1, :]

user_id         1000
name            John
age               33
country          USA
score            6.7
continent    America
Name: 1, dtype: object

In [10]:
# Select 1 column in an array - DataFrame
df.loc[:, ["country"]]

         country
user_id
0          Italy
1            USA
2            USA
3        Germany

In [11]:
# Select 1 row in an array - DataFrame
df.loc[[1], :]

         user_id  name  age country  score continent
user_id
1           1000  John   33     USA    6.7   America

In [12]:
# Select multiple columns - DataFrame
df.loc[:, ["name", "country"]]

          name  country
user_id
0         Mark    Italy
1         John      USA
2          Tim      USA
3        Jenny  Germany

In [13]:
# Select range of columns - DataFrame
df.loc[:, "name":"country"]

          name  age  country
user_id
0         Mark   55    Italy
1         John   33      USA
2          Tim   41      USA
3        Jenny   12  Germany

## Selecting Data by label

In [14]:
# Select 1 value - Scalar
df.iloc[0, 1]

'Mark'

In [15]:
# Select 1 column - Series
df.iloc[:, 1]

user_id
0     Mark
1     John
2      Tim
3    Jenny
Name: name, dtype: object

In [16]:
# Select 1 row - Series
df.iloc[1, :]

user_id         1000
name            John
age               33
country          USA
score            6.7
continent    America
Name: 1, dtype: object

In [17]:
# Select 1 column in an array - DataFrame
df.iloc[:, [1]]

          name
user_id
0         Mark
1         John
2          Tim
3        Jenny

In [18]:
# Select 1 row in an array - DataFrame
df.iloc[[1], :]

         user_id  name  age country  score continent
user_id
1           1000  John   33     USA    6.7   America

In [19]:
# Select multiple columns - DataFrame 
df.iloc[:, [2, 1]]

         age   name
user_id
0         55   Mark
1         33   John
2         41    Tim
3         12  Jenny

In [20]:
# Select multiple rows - DataFrame 
df.iloc[[3, 1], :]

         user_id   name  age  country  score continent
user_id
3           1003  Jenny   12  Germany    9.0    Europe
1           1000   John   33      USA    6.7   America

In [22]:
# Select range of columns - DataFrame
df.iloc[:, 1:3]

          name  age
user_id
0         Mark   55
1         John   33
2          Tim   41
3        Jenny   12

In [23]:
df.iloc[:, :3]

         user_id   name  age
user_id
0           1001   Mark   55
1           1000   John   33
2           1002    Tim   41
3           1003  Jenny   12

In [24]:
# Select range of rows - DataFrame
df.iloc[1:3, :]

         user_id  name  age country  score continent
user_id
1           1000  John   33     USA    6.7   America
2           1002   Tim   41     USA    3.9   America

In [25]:
df.iloc[:3, :]

         user_id  name  age country  score continent
user_id
0           1001  Mark   55   Italy    4.5    Europe
1           1000  John   33     USA    6.7   America
2           1002   Tim   41     USA    3.9   America